
{{alias}}( z1, z2 )
    Divides two double-precision complex floating-point numbers.

    Parameters
    ----------
    z1: Complex128
        Complex number.

    z2: Complex128
        Complex number.

    Returns
    -------
    out: Complex128
        Result.

    Examples
    --------
    > var z1 = new {{alias:@stdlib/complex/float64/ctor}}( -13.0, -1.0 )
    <Complex128>
    > var z2 = new {{alias:@stdlib/complex/float64/ctor}}( -2.0, 1.0 )
    <Complex128>
    > var y = {{alias}}( z1, z2 )
    <Complex128>
    > var re = {{alias:@stdlib/complex/float64/real}}( y )
    5.0
    > var im = {{alias:@stdlib/complex/float64/imag}}( y )
    3.0

    See Also
    --------

