
{{alias}}( x )
    Computes the inverse cotangent of a single-precision floating-point number.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Inverse cotangent (in radians).

    Examples
    --------
    > var y = {{alias}}( 2.0 )
    ~0.4636
    > y = {{alias}}( 0.0 )
    ~1.5708
    > y = {{alias}}( 0.5 )
    ~1.1071
    > y = {{alias}}( 1.0 )
    ~0.7854
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

