
{{alias}}( x )
    Computes the Bessel function of the first kind of order zero.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Bessel function of the first kind of order zero.

    Examples
    --------
    > var y = {{alias}}( 0.0 )
    1.0
    > y = {{alias}}( 1.0 )
    0.76519768655796649
    > y = {{alias}}( Infinity )
    0.0
    > y = {{alias}}( -Infinity )
    0.0
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

