
{{alias}}( x )
    Computes the arctangent of a double-precision floating-point number.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Arctangent (in radians).

    Examples
    --------
    > var y = {{alias}}( 0.0 )
    ~0.0
    > y = {{alias}}( -{{alias:@stdlib/constants/float64/pi}}/2.0 )
    ~-1.004
    > y = {{alias}}( {{alias:@stdlib/constants/float64/pi}}/2.0 )
    ~1.004
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

