
{{alias}}( k )
    Evaluates the cumulative distribution function (CDF) for a Rademacher
    distribution.

    If provided `NaN`, the function returns `NaN`.

    Parameters
    ----------
    k: number
        Input value.

    Returns
    -------
    out: number
        Evaluated CDF.

    Examples
    --------
    > var v = {{alias}}( 0.0 )
    0.5
    > v = {{alias}}( 1.0 )
    1.0
    > v = {{alias}}( -2.0 )
    0.0
    > v = {{alias}}( NaN )
    NaN

    See Also
    --------

