
{{alias}}( x )
    Computes the Fresnel integral C(x).

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        C(x).

    Examples
    --------
    > var y = {{alias}}( 0.0 )
    ~0.0
    > y = {{alias}}( 1.0 )
    ~0.780
    > y = {{alias}}( {{alias:@stdlib/constants/float64/pinf}} )
    ~0.5
    > y = {{alias}}( {{alias:@stdlib/constants/float64/ninf}} )
    ~-0.5
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

