
{{alias}}( x )
    Evaluates factorial2 of `x`.

    If provided `NaN`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Factorial2.

    Examples
    --------
    > var y = {{alias}}( 3.0 )
    3.0
    > var y = {{alias}}( 5.0 )
    15.0
    > var y = {{alias}}( 6.0 )
    48.0
    > y = {{alias}}( 301.0 )
    Infinity
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

