
{{alias}}( x )
    Evaluates the double factorial of `x`.

    If provided `NaN`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Double factorial.

    Examples
    --------
    > var y = {{alias}}( 3 )
    3
    > y = {{alias}}( 5 )
    15
    > y = {{alias}}( 6 )
    48
    > y = {{alias}}( 301 )
    Infinity
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

