
{{alias}}( z )
    Negates a single-precision complex floating-point number.

    Parameters
    ----------
    z: Complex64
       Complex number.

    Returns
    -------
    out: Complex64
        Result.

    Examples
    --------
    > var z = new {{alias:@stdlib/complex/float32/ctor}}( -4.0, 5.0 )
    <Complex64>
    > var v = {{alias}}( z )
    <Complex64>
    > var re = {{alias:@stdlib/complex/realf}}( v )
    4.0
    > var im = {{alias:@stdlib/complex/imagf}}( v )
    -5.0

    See Also
    --------

