
{{alias}}( z )
    Evaluates the cis function for a double-precision complex floating-point
    number.

    Parameters
    ----------
    z: Complex128
        Complex number.

    Returns
    -------
    out: Complex128
        Complex number.

    Examples
    --------
    > var y = {{alias}}( new {{alias:@stdlib/complex/float64}}( 0.0, 0.0 ) )
    <Complex128>
    > var re = {{alias:@stdlib/complex/real}}( y )
    1.0
    > var im = {{alias:@stdlib/complex/imag}}( y )
    0.0
    > y = {{alias}}( new {{alias:@stdlib/complex/float64}}( 1.0, 0.0 ) )
    <Complex128>
    > re = {{alias:@stdlib/complex/real}}( y )
    ~0.540
    > im = {{alias:@stdlib/complex/imag}}( y )
    ~0.841

    See Also
    --------

