
{{alias}}( x )
    Converts a single-precision floating-point number to a signed 32-bit
    integer.

    Parameters
    ----------
    x: float
        Single-precision floating-point number.

    Returns
    -------
    out: integer
        Signed 32-bit integer.

    Examples
    --------
    > var y = {{alias}}( {{alias:@stdlib/number/float64/base/to-float32}}( 4294967295.0 ) )
    0
    > y = {{alias}}( {{alias:@stdlib/number/float64/base/to-float32}}( 3.14 ) )
    3
    > y = {{alias}}( {{alias:@stdlib/number/float64/base/to-float32}}( -3.14 ) )
    -3
    > y = {{alias}}( {{alias:@stdlib/number/float64/base/to-float32}}( NaN ) )
    0
    > y = {{alias}}( {{alias:@stdlib/constants/float32/pinf}} )
    0
    > y = {{alias}}( {{alias:@stdlib/constants/float32/ninf}} )
    0

    See Also
    --------
