
{{alias}}( z1, z2 )
    Adds two double-precision complex floating-point numbers.

    Parameters
    ----------
    z1: Complex128
        Complex number.

    z2: Complex128
        Complex number.

    Returns
    -------
    out: Complex128
        Result.

    Examples
    --------
    > var z = new {{alias:@stdlib/complex/float64/ctor}}( 5.0, 3.0 )
    <Complex128>
    > var out = {{alias}}( z, z )
    <Complex128>
    > var re = {{alias:@stdlib/complex/float64/real}}( out )
    10.0
    > var im = {{alias:@stdlib/complex/float64/imag}}( out )
    6.0

    See Also
    --------

