
{{alias}}( x )
    Computes the secant of a degree.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Secant (in degree).

    Examples
    --------
    > var y = {{alias}}( 1.0 )
    ~1.0
    > y = {{alias}}( {{alias:@stdlib/constants/float64/pi}} )
    ~1.0
    > y = {{alias}}( -{{alias:@stdlib/constants/float64/pi}} )
    ~1.0
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

