
{{alias}}( x )
    Computes the reciprocal cubic root of a double-precision floating-point
    number.

    For `x < 0`, the reciprocal cubic root is not defined.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Reciprocal cubic root.

    Examples
    --------
    > var y = {{alias}}( 8.0 )
    0.5
    > y = {{alias}}( 1000.0 )
    0.1
    > y = {{alias}}( 0.0 )
    Infinity
    > y = {{alias}}( Infinity )
    0.0
    > y = {{alias}}( -8.0 )
    -0.5
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

