
{{alias}}( z1, z2 )
    Adds two single-precision complex floating-point numbers.

    Parameters
    ----------
    z1: Complex64
        Complex number.

    z2: Complex64
        Complex number.

    Returns
    -------
    out: Complex64
        Result.

    Examples
    --------
    > var z = new {{alias:@stdlib/complex/float32/ctor}}( 5.0, 3.0 )
    <Complex64>
    > var out = {{alias}}( z, z )
    <Complex64>
    > var re = {{alias:@stdlib/complex/realf}}( out )
    10.0
    > var im = {{alias:@stdlib/complex/imagf}}( out )
    6.0

    See Also
    --------

