
{{alias}}( x )
    Computes the cotangent of degree.

    Parameters
    ----------
    x: number
        Input value (in degree).

    Returns
    -------
    y: number
        Cotangent.

    Examples
    --------
    > var y = {{alias}}( 0.0 )
    Infinity
    > y = {{alias}}( 90 )
    0.0
    > y = {{alias}}( 60 )
    0.577350269189626
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

