
{{alias}}( z1, z2 )
    Subtracts two single-precision complex floating-point numbers.

    Parameters
    ----------
    z1: Complex64
        Complex number.

    z2: Complex64
        Complex number.

    Returns
    -------
    out: Complex64
        Result.

    Examples
    --------
    > var z1 = new {{alias:@stdlib/complex/float32/ctor}}( 5.0, 3.0 )
    <Complex64>
    > var z2 = new {{alias:@stdlib/complex/float32/ctor}}( -2.0, 1.0 )
    <Complex64>
    > var out = {{alias}}( z1, z2 )
    <Complex64>
    > var re = {{alias:@stdlib/complex/realf}}( out )
    7.0
    > var im = {{alias:@stdlib/complex/imagf}}( out )
    2.0

    See Also
    --------

