
{{alias}}( z1, z2 )
    Multiplies two double-precision complex floating-point numbers.

    Parameters
    ----------
    z1: Complex128
        Complex number.

    z2: Complex128
        Complex number.

    Returns
    -------
    out: Complex128
        Result.

    Examples
    --------
    > var z1 = new {{alias:@stdlib/complex/float64}}( 5.0, 3.0 )
    <Complex128>
    > var z2 = new {{alias:@stdlib/complex/float64}}( -2.0, 1.0 )
    <Complex128>
    > var out = {{alias}}( z1, z2 )
    <Complex128>
    > var re = {{alias:@stdlib/complex/real}}( out )
    -13.0
    > var im = {{alias:@stdlib/complex/imag}}( out )
    -1.0

    See Also
    --------

