
{{alias}}( x, k, λ )
    Evaluates the cumulative distribution function (CDF) for a Weibull
    distribution with shape parameter `k` and scale parameter `λ` at a value
    `x`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided a non-positive value for `λ` or `k`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    k: number
        Shape parameter.

    λ: number
        Scale parameter.

    Returns
    -------
    out: number
        Evaluated CDF.

    Examples
    --------
    > var y = {{alias}}( 2.0, 1.0, 1.0 )
    ~0.865
    > y = {{alias}}( -1.0, 2.0, 2.0 )
    0.0
    > y = {{alias}}( {{alias:@stdlib/constants/float64/pinf}}, 4.0, 2.0 )
    1.0
    > y = {{alias}}( {{alias:@stdlib/constants/float64/ninf}}, 4.0, 2.0 )
    0.0
    > y = {{alias}}( NaN, 0.0, 1.0 )
    NaN
    > y = {{alias}}( 0.0, NaN, 1.0 )
    NaN
    > y = {{alias}}( 0.0, 0.0, NaN )
    NaN
    > y = {{alias}}( 2.0, 0.0, -1.0 )
    NaN


{{alias}}.factory( k, λ )
    Returns a function for evaluating the cumulative distribution function (CDF)
    of a Weibull distribution with shape parameter `k` and scale parameter `λ`.

    Parameters
    ----------
    k: number
        Shape parameter.

    λ: number
        Scale parameter.

    Returns
    -------
    cdf: Function
        Cumulative distribution function (CDF).

    Examples
    --------
    > var myCDF = {{alias}}.factory( 2.0, 10.0 );
    > var y = myCDF( 12.0 )
    ~0.763

    See Also
    --------

