
{{alias}}( x )
    Computes the hyperbolic cosine of a double-precision floating-point number.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Hyperbolic cosine.

    Examples
    --------
    > var y = {{alias}}( 0.0 )
    1.0
    > y = {{alias}}( 2.0 )
    ~3.762
    > y = {{alias}}( -2.0 )
    ~3.762
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

