
{{alias}}( z )
    Negates a double-precision complex floating-point number.

    Parameters
    ----------
    z: Complex128
       Complex number.

    Returns
    -------
    out: Complex128
        Result.

    Examples
    --------
    > var z = new {{alias:@stdlib/complex/float64}}( -4.2, 5.5 )
    <Complex128>
    > var v = {{alias}}( z )
    <Complex128>
    > var re = {{alias:@stdlib/complex/real}}( v )
    4.2
    > var im = {{alias:@stdlib/complex/imag}}( v )
    -5.5

    See Also
    --------

