
{{alias}}( x, d1, d2 )
    Evaluates the cumulative distribution function (CDF) for an F distribution
    with numerator degrees of freedom `d1` and denominator degrees of freedom
    `d2` at a value `x`.

    If provided `NaN` as any argument, the function returns `NaN`.

    If provided `d1 <= 0` or `d2 <= 0`, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    d1: number
        Numerator degrees of freedom.

    d2: number
        Denominator degrees of freedom.

    Returns
    -------
    out: number
        Evaluated CDF.

    Examples
    --------
    > var y = {{alias}}( 2.0, 1.0, 1.0 )
    ~0.608
    > var y = {{alias}}( 2.0, 8.0, 4.0 )
    ~0.737
    > var y = {{alias}}( -1.0, 2.0, 2.0 )
    0.0
    > var y = {{alias}}( {{alias:@stdlib/constants/float64/pinf}}, 4.0, 2.0 )
    1.0
    > var y = {{alias}}( {{alias:@stdlib/constants/float64/ninf}}, 4.0, 2.0 )
    0.0

    > var y = {{alias}}( NaN, 1.0, 1.0 )
    NaN
    > var y = {{alias}}( 0.0, NaN, 1.0 )
    NaN
    > var y = {{alias}}( 0.0, 1.0, NaN )
    NaN

    > var y = {{alias}}( 2.0, 1.0, -1.0 )
    NaN
    > var y = {{alias}}( 2.0, -1.0, 1.0 )
    NaN


{{alias}}.factory( d1, d2 )
    Returns a function for evaluating the cumulative distribution function (CDF)
    of an F distribution with numerator degrees of freedom `d1` and denominator
    degrees of freedom `d2`.

    Parameters
    ----------
    d1: number
        Numerator degrees of freedom.

    d2: number
        Denominator degrees of freedom.

    Returns
    -------
    cdf: Function
        Cumulative distribution function (CDF).

    Examples
    --------
    > var myCDF = {{alias}}.factory( 10.0, 2.0 );
    > var y = myCDF( 10.0 )
    ~0.906
    > y = myCDF( 8.0 )
    ~0.884

    See Also
    --------

