
{{alias}}( x )
    Computes the Bessel function of the second kind of order zero.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var y = {{alias}}( 0.0 )
    -Infinity
    > y = {{alias}}( 1.0 )
    ~0.088
    > y = {{alias}}( -1.0 )
    NaN
    > y = {{alias}}( {{alias:@stdlib/constants/float64/pinf}} )
    0.0
    > y = {{alias}}( {{alias:@stdlib/constants/float64/ninf}} )
    NaN
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

