
{{alias}}( x )
    Computes the sign of the gamma function.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Sign of the gamma function.

    Examples
    --------
    > var y = {{alias}}( 1.0 )
    1.0
    > y = {{alias}}( -2.5 )
    -1.0
    > y = {{alias}}( 0.0 )
    0.0
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------
