
{{alias}}( x )
    Evaluates the identity function for a single-precision floating-point number
    `x`.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Input value.

    Examples
    --------
    > var y = {{alias}}( -1.0 )
    -1.0
    > y = {{alias}}( 2.0 )
    2.0
    > y = {{alias}}( 0.0 )
    0.0
    > y = {{alias}}( -0.0 )
    -0.0
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

