
{{alias}}( x )
    Evaluates the natural logarithm of `1-exp(-|x|)`.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var y = {{alias}}( -10.0 )
    ~-0.00005
    > y = {{alias}}( 0.0 )
    -Infinity
    > y = {{alias}}( 5.0 )
    ~-0.00676
    > y = {{alias}}( 10.0 )
    ~-0.00005
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------
