
{{alias}}( x )
    Computes the cosecant of a number.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Cosecant (in degree).

    Examples
    --------
    > var y = {{alias}}( 1.0 )
    57.298688498550185
    > y = {{alias}}( {{alias:@stdlib/constants/float64/pi}} )
    18.246954784594134
    > y = {{alias}}( -{{alias:@stdlib/constants/float64/pi}} )
    ~-18.246954784594134
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

