
{{alias}}( x )
    Computes the cosecant of a degree.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Cosecant (in degree).

    Examples
    --------
    > var y = {{alias}}( 1.0 )
    ~57.30
    > y = {{alias}}( {{alias:@stdlib/constants/float64/pi}} )
    ~18.25
    > y = {{alias}}( -{{alias:@stdlib/constants/float64/pi}} )
    ~-18.25
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

