
{{alias}}( x )
    Computes the reciprocal cube root of a single-precision floating-point
    number.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Reciprocal cube root.

    Examples
    --------
    > var y = {{alias}}( 8.0 )
    0.5
    > y = {{alias}}( 1000.0 )
    ~0.1
    > y = {{alias}}( 0.0 )
    Infinity
    > y = {{alias}}( {{alias:@stdlib/constants/float64/pinf}} )
    0.0
    > y = {{alias}}( -8.0 )
    -0.5
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

