
{{alias}}( x )
    Evaluates the natural logarithm.

    For negative numbers, the natural logarithm is not defined.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var y = {{alias}}( 4.0 )
    ~1.386
    > y = {{alias}}( 0.0 )
    -infinity
    > y = {{alias}}( {{alias:@stdlib/math/constants/float64-pinf}} )
    infinity
    > y = {{alias}}( NaN )
    NaN
    > y = {{alias}}( -4.0 )
    NaN

    See Also
    --------

