
{{alias}}( x )
    Evaluates the natural logarithm of a single-precision floating-point number.

    For negative numbers, the natural logarithm is not defined.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var y = {{alias}}( 4.0 )
    ~1.386
    > y = {{alias}}( 0.0 )
    -Infinity
    > y = {{alias}}( {{alias:@stdlib/constants/float32/pinf}} )
    Infinity
    > y = {{alias}}( NaN )
    NaN
    > y = {{alias}}( -4.0 )
    NaN

    See Also
    --------

