
{{alias}}( x )
    Rounds a numeric value toward zero.

    Parameters
    ----------
    x: double
        Input value.

    Returns
    -------
    y: double
        Rounded value.

    Examples
    --------
    > var y = {{alias}}( 3.14 )
    3.0
    > y = {{alias}}( -4.2 )
    -4.0
    > y = {{alias}}( -4.6 )
    -4.0
    > y = {{alias}}( 9.5 )
    9.0
    > y = {{alias}}( -0.0 )
    -0.0

    See Also
    --------

