
{{alias}}( x )
    Computes the arccosecant of (in degrees) a double-precision floating-point
    number.

    If `x` does not satisy `x >= 1` or `x <= -1`, the function returns NaN.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Arccosecant (in degrees).

    Examples
    --------
    > var y = {{alias}}( 0.0 )
    NaN
    > y = {{alias}}( {{alias:@stdlib/constants/float64/pi}}/6.0 )
    NaN
    > y = {{alias}}( 1 )
    90.0
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

