
{{alias}}( x, y, z )
    Computes the sum of three double-precision floating-point numbers.

    Parameters
    ----------
    x: number
        First input value.

    y: number
        Second input value.

    z: number
        Third input value.

    Returns
    -------
    out: number
        Sum.

    Examples
    --------
    > var v = {{alias}}( -1.0, 5.0, 2.0 )
    6.0
    > v = {{alias}}( 2.0, 5.0, 2.0 )
    9.0
    > v = {{alias}}( 0.0, 5.0, 2.0 )
    7.0
    > v = {{alias}}( -0.0, 0.0, -0.0 )
    0.0
    > v = {{alias}}( NaN, NaN, NaN )
    NaN

    See Also
    --------

