
{{alias}}( x )
    Returns a string giving the literal bit representation of a double-precision
    floating-point number.

    Parameters
    ----------
    x: number
        Double-precision floating-point number.

    Returns
    -------
    bstr: string
        Bit representation.

    Examples
    --------
    > var str = {{alias}}( 4.0 )
    '0100000000010000000000000000000000000000000000000000000000000000'
    > str = {{alias}}( {{alias:@stdlib/constants/float64/pi}} )
    '0100000000001001001000011111101101010100010001000010110100011000'
    > str = {{alias}}( -1.0e308 )
    '1111111111100001110011001111001110000101111010111100100010100000'
    > str = {{alias}}( -3.14e-320 )
    '1000000000000000000000000000000000000000000000000001100011010011'
    > str = {{alias}}( 5.0e-324 )
    '0000000000000000000000000000000000000000000000000000000000000001'
    > str = {{alias}}( 0.0 )
    '0000000000000000000000000000000000000000000000000000000000000000'
    > str = {{alias}}( -0.0 )
    '1000000000000000000000000000000000000000000000000000000000000000'
    > str = {{alias}}( NaN )
    '0111111111111000000000000000000000000000000000000000000000000000'
    > str = {{alias}}( {{alias:@stdlib/constants/float64/pinf}} )
    '0111111111110000000000000000000000000000000000000000000000000000'
    > str = {{alias}}( {{alias:@stdlib/constants/float64/ninf}} )
    '1111111111110000000000000000000000000000000000000000000000000000'

    See Also
    --------

