
{{alias}}( x )
    Converts a single-precision floating-point number to a unsigned 32-bit
    integer.

    Parameters
    ----------
    x: float
        Single-precision floating-point number.

    Returns
    -------
    out: integer
        Unsigned 32-bit integer.

    Examples
    --------
    > var y = {{alias}}( {{alias:@stdlib/number/float64/base/to-float32}}( 4294967297.0 ) )
    0
    > y = {{alias}}( {{alias:@stdlib/number/float64/base/to-float32}}( 3.14 ) )
    3
    > y = {{alias}}( {{alias:@stdlib/number/float64/base/to-float32}}( -3.14 ) )
    4294967293
    > y = {{alias}}( {{alias:@stdlib/number/float64/base/to-float32}}( NaN ) )
    0
    > y = {{alias}}( {{alias:@stdlib/constants/float32/pinf}} )
    0
    > y = {{alias}}( {{alias:@stdlib/constants/float32/ninf}} )
    0

    See Also
    --------
