
{{alias}}( x )
    Computes the Bessel function of the first kind of order one.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Bessel function of the first kind of order one.

    Examples
    --------
    > var y = {{alias}}( 0.0 )
    0.0
    > y = {{alias}}( 1.0 )
    ~0.440
    > y = {{alias}}( {{alias:@stdlib/math/constants/float64-pinf}} )
    0.0
    > y = {{alias}}( {{alias:@stdlib/math/constants/float64-ninf}} )
    0.0
    > y = {{alias}}( NaN )
    NaN

    See Also
    --------

