
{{alias}}( x )
    Evaluates the binary logarithm (base two).

    For negative numbers, the binary logarithm is not defined.

    Parameters
    ----------
    x: number
        Input value.

    Returns
    -------
    y: number
        Function value.

    Examples
    --------
    > var y = {{alias}}( 4.0 )
    2.0
    > y = {{alias}}( 8.0 )
    3.0
    > y = {{alias}}( 0.0 )
    -Infinity
    > y = {{alias}}( {{alias:@stdlib/constants/float64/pinf}} )
    Infinity
    > y = {{alias}}( NaN )
    NaN
    > y = {{alias}}( -4.0 )
    NaN

    See Also
    --------

