
{{alias}}( x, α, β )
    Evaluates the logarithm of the cumulative distribution function (CDF) for a
    gamma distribution with shape parameter `α` and rate parameter `β` at a
    value `x`.

    If `α < 0` or `β <= 0`, the function returns `NaN`.

    If provided `NaN` as any argument, the function returns `NaN`.

    Parameters
    ----------
    x: number
        Input value.

    α: number
        Shape parameter.

    β: number
        Rate parameter.

    Returns
    -------
    out: number
        Evaluated logCDF.

    Examples
    --------
    > var y = {{alias}}( 2.0, 0.5, 1.0 )
    ~-0.047
    > y = {{alias}}( 0.1, 1.0, 1.0 )
    ~-2.352
    > y = {{alias}}( -1.0, 4.0, 2.0 )
    -Infinity

    > y = {{alias}}( NaN, 0.6, 1.0 )
    NaN
    > y = {{alias}}( 0.0, NaN, 1.0 )
    NaN
    > y = {{alias}}( 0.0, 1.0, NaN )
    NaN

    // Negative shape parameter:
    > y = {{alias}}( 2.0, -1.0, 1.0 )
    NaN
    // Non-positive rate parameter:
    > y = {{alias}}( 2.0, 1.0, -1.0 )
    NaN


{{alias}}.factory( α, β )
    Returns a function for evaluating the logarithm of the cumulative
    distribution function (CDF) of a gamma distribution with shape parameter `α`
    and rate parameter `β`.

    Parameters
    ----------
    α: number
        Shape parameter.

    β: number
        Rate parameter.

    Returns
    -------
    logcdf: Function
        Logarithm of cumulative distribution function (CDF).

    Examples
    --------
    > var mylogCDF = {{alias}}.factory( 6.0, 7.0 );
    > var y = mylogCDF( 2.0 )
    ~-0.006

    See Also
    --------

